{
"#" : "Demo #6",
  
"#" : "The sixth YAML configuration file in our tutorial about using Galsim config files",
"#" : "(This file is designed to be view in a window 100 characters wide.)",
  
"#" : "This script uses real galaxy images from COSMOS observations.  The catalog of real galaxy",
"#" : "images distributed with GalSim only includes 100 galaxies, but you can download a much",
"#" : "larger set of images from: https://www.dropbox.com/sh/ns2yh4q00trqs5r/JypUX8qwLw",

"#" : "The galaxy images include images of the effective PSF for the original observations, ",
"#" : "so GalSim first deconvolves by that PSF, and then convolves by whatever PSF you desire.",
"#" : "In this case, we use a double Gaussian PSF.  The galaxies are randomly rotated and then",
"#" : "given an applied gravitational shear as well as gravitational magnification.",
"#" : "The output for this script is to a FITS data cube.  With DS9, this can be view with a",
"#" : "slider to quickly move through the different images.",
       
"#" : "New features introduced in this demo:",

"#" : "- input : real_catalog (file_name, image_dir, preload)",
"#" : "- obj type : RealGalaxy (index)",
"#" : "- obj : rotate ",
"#" : "- obj : magnify",
"#" : "- image : sky_level",
"#" : "- value type : Sequence",
"#" : "- output type : DataCube (file_name, dir, nimages)",
"#" : "- Using YAML's multiple document feature to do more than one thing",

"#" : "For this example, we actually have two config files, since we have two different kinds",
"#" : "of output files to make.  The first, demo6a.json is for the psf output,",
"#" : "and the second, demo6b.json is for the convolved galaxy images.",
"#" : "Out JSON parser can take multiple input files on the command line, and will run all",
"#" : "of them.",

"#" : "Define the PSF profile",
"psf" : {
    "type" : "Sum",
    "items" : [
        { "type" : "Gaussian", "fwhm" : 0.6, "flux" : 0.8 },
        { "type" : "Gaussian", "fwhm" : 2.3, "flux" : 0.2 }
    ]
},

"#" : "Define some other information about the images ",
"image" : {
    "pixel_scale" : 0.15,

    "#" : "Define the initial random number seed",
    "random_seed" : 1512413,

    "#" : "Note: since the output includes a data_cube output, which requires all the",
    "#" : "images to be the same size, GalSim will choose the size of the first image",
    "#" : "automatically from the profile (since we aren't setting any image : size here),",
    "#" : "but then subsequent images will be forced to be the same size as the first one."
},

"output" : {
    "dir" : "output_json",
    "file_name" : "psf_real.fits"
}

}
